### Question 1
###### What's the version of Pandas that you installed?

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.5.3'

### Question 2
##### How many columns are in the dataset?

In [4]:
url= 'https://raw.githubusercontent.com/alexeygrigorev/datasets/master/housing.csv'

In [5]:
df = pd.read_csv(url)
df.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [6]:
df.shape

(20640, 10)

In [7]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity'],
      dtype='object')

### Question 3: Select columns with missing data

In [8]:
df.isnull().sum()

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
dtype: int64

### Question 4: Number of unique values in the 'ocean_proximity' column

In [9]:
df.head(3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY

In [10]:
df['ocean_proximity'].unique()

array(['NEAR BAY', '<1H OCEAN', 'INLAND', 'NEAR OCEAN', 'ISLAND'],
      dtype=object)

### Question 5: Average value of the 'median_house_value' for the houses near the bay

In [11]:
df.head(1)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY

In [18]:
avg_near_bay = df.groupby('ocean_proximity').get_group('NEAR BAY')['median_house_value'].mean()
avg_near_bay.round()

259212.0

#### Question 6

In [19]:
df.head(2)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY

###### Calculate the average of total_bedrooms column in the dataset.

In [20]:
total_bedroom_avg = df['total_bedrooms'].mean()
total_bedroom_avg

537.8705525375618

###### Use the fillna method to fill the missing values in total_bedrooms with the mean value from the previous step.

In [21]:
df_new = df.fillna(total_bedroom_avg)
df_new.isna().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
ocean_proximity       0
dtype: int64

537.8705525375617

###### Now, calculate the average of total_bedrooms again.

In [23]:
df_new['total_bedrooms'].mean()

537.8705525375617

###### Has it changed?
##### NO

### Question 7


##### What's the value of the last element of w?

##### Select all the options located on islands.

In [24]:
island_house = df_new.groupby('ocean_proximity').get_group('ISLAND')
island_house

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
8314,-118.32,33.35,27.0,1675.0,521.0,744.0,331.0,2.1579,450000.0,ISLAND
8315,-118.33,33.34,52.0,2359.0,591.0,1100.0,431.0,2.8333,414700.0,ISLAND
8316,-118.32,33.33,52.0,2127.0,512.0,733.0,288.0,3.3906,300000.0,ISLAND
8317,-118.32,33.34,52.0,996.0,264.0,341.0,160.0,2.7361,450000.0,ISLAND
8318,-118.48,33.43,29.0,716.0,214.0,422.0,173.0,2.6042,287500.0,ISLAND

##### Select only columns housing_median_age, total_rooms, total_bedrooms.

In [25]:
subset = island_house[['housing_median_age', 'total_rooms', 'total_bedrooms']]
subset

      housing_median_age  total_rooms  total_bedrooms
8314                27.0       1675.0           521.0
8315                52.0       2359.0           591.0
8316                52.0       2127.0           512.0
8317                52.0        996.0           264.0
8318                29.0        716.0           214.0

##### Get the underlying NumPy array. Let's call it X.

In [26]:
import numpy as np

In [27]:
X = np.array(subset)
X.shape

(5, 3)

##### Compute matrix-matrix multiplication between the transpose of X and X. To get the transpose, use X.T. Let's call the result XTX.

In [28]:
XT = np.transpose(X)
XT.shape

(3, 5)

In [76]:
XTX = X @ XT
XTX

array([[3077795., 4260640., 3830881., 1807248., 1311577.],
       [4260640., 5916866., 5322889., 2508292., 1817026.],
       [3830881., 5322889., 4788977., 2256364., 1634008.],
       [1807248., 2508292., 2256364., 1064416.,  771140.],
       [1311577., 1817026., 1634008.,  771140.,  559293.]])

In [47]:
XTX.shape

(5, 5)

##### Compute the inverse of XTX.

In [48]:
inverse = np.linalg.inv(XTX)
inverse.shape

(5, 5)

##### Create an array y with values [950, 1300, 800, 1000, 1300].

In [78]:
y = np.array((950, 1300, 800, 1000, 1300))
y.shape

(5,)

##### Multiply the inverse of XTX with the transpose of X, and then multiply the result by y. Call the result w.

In [79]:
temp = XT.dot(inverse)
w = temp.dot(y)
w

array([  15.87753296, -141.87927246,  -28.7399292 ])